<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

In [15]:
import os
os.getcwd()

'E:\\github\\GeneticAlgorithmTSP'

In [17]:
import pandas as pd
import GeneticAlgoLibrary

In [19]:
data = pd.read_csv("./data/cities_and_distances.csv")
data.reset_index(inplace=True)
data1 = data.iloc[:,2:]
data1.index = data1.columns.values
data1

,Bangalore,Jaipur,Varanasi,Udaipur,Delhi,Chennai,Mysore,Agra,Kolkata,Mumbai,Hyderabad
Bangalore,0,2026,1825,1724,2166,346,149,1923,1862,980,569
Jaipur,2026,0,849,393,287,2108,2121,240,1520,1146,1483
Varanasi,1825,849,0,1154,834,1862,1976,614,683,1524,1237
Udaipur,1724,393,1154,0,661,2077,1809,634,1825,753,1349
Delhi,2166,287,834,661,0,2203,2317,233,1498,1415,1578
Chennai,346,2108,1862,2077,2203,0,482,1957,1669,1345,627
Mysore,149,2121,1976,1809,2317,482,0,2072,2012,1064,718
Agra,1923,240,614,634,233,1957,2072,0,1280,1323,1334
Kolkata,1862,1520,683,1825,1498,1669,2012,1280,0,2053,1493
Mumbai,980,1146,1524,753,1415,1345,1064,1323,2053,0,711
Hyderabad,569,1483,1237,1349,1578,627,718,1334,1493,711,0

In [20]:
ga_obj =  GeneticAlgoLibrary.GeneticAlgorithmTSP(number_of_cities=11,
                             initial_pop_size=10,
                             nelite=5,
                             percentage_to_crossover=30,
                             percentage_to_mutate=20,
                             dist_mat=data1)

In [21]:
ga_obj.initialPopCost()

                             Route   Cost
8  [3, 4, 5, 8, 7, 1, 2, 10, 9, 6]  11787
7  [6, 3, 4, 2, 1, 5, 7, 8, 9, 10]  12980
3  [6, 3, 1, 10, 2, 7, 8, 4, 5, 9]  12991
2  [5, 4, 8, 6, 10, 1, 3, 9, 7, 2]  13168
0  [9, 3, 4, 7, 6, 1, 8, 5, 10, 2]  13698
1  [5, 6, 4, 9, 8, 1, 10, 3, 7, 2]  14038
6  [1, 10, 4, 7, 8, 2, 9, 5, 3, 6]  14187
9  [2, 7, 5, 8, 6, 1, 4, 9, 3, 10]  14571
4  [2, 3, 5, 6, 10, 7, 8, 1, 9, 4]  15117
5  [8, 9, 2, 5, 6, 1, 10, 4, 7, 3]  15556

In [22]:
ga_obj.theEliteFew()

                             Route   Cost
8  [3, 4, 5, 8, 7, 1, 2, 10, 9, 6]  11787
7  [6, 3, 4, 2, 1, 5, 7, 8, 9, 10]  12980
3  [6, 3, 1, 10, 2, 7, 8, 4, 5, 9]  12991
2  [5, 4, 8, 6, 10, 1, 3, 9, 7, 2]  13168
0  [9, 3, 4, 7, 6, 1, 8, 5, 10, 2]  13698

In [23]:
ga_obj.mutationFunction(ga_obj.theEliteFew())

                             Route   Cost
0  [4, 5, 8, 7, 1, 2, 10, 9, 6, 3]  14952
1  [1, 5, 7, 8, 9, 10, 6, 3, 4, 2]  15982
2  [3, 1, 10, 2, 7, 8, 4, 5, 9, 6]  12990
3  [10, 1, 3, 9, 7, 2, 5, 4, 8, 6]  12859
4  [4, 7, 6, 1, 8, 5, 10, 2, 9, 3]  15646

In [24]:
ga_obj = GeneticAlgoLibrary.OverallGaRun(noverall=1,
                                     number_of_cities=11,
                                     initial_pop_size=1000,
                                     nelite=10,
                                     percentage_to_crossover=20,
                                     percentage_to_mutate=20,
                                     dist_mat=data1)

In [26]:
for i in [10,100,1000]:
    ga_obj = GeneticAlgoLibrary.OverallGaRun(noverall=i,
                                           number_of_cities=11,
                                           initial_pop_size=10000,
                                           nelite=10,
                                           percentage_to_crossover=20,
                                           percentage_to_mutate=20,
                                           dist_mat=data1)
    ga_obj.runOverallGa()

Starting 10 iterations of the GA
-------------------------------------------------------------------------------------------
Best solution for initial population size of 10000 and number of runs 10 is
                              Route  Cost
0  [6, 5, 10, 8, 2, 1, 4, 7, 3, 9]  7170
Generated 20(0.001%) of the 3628800 solutions
Total distance travelled to cover the final route of
 Bangalore => Mysore => Chennai => Hyderabad => Kolkata => Varanasi => Jaipur => Delhi => Agra => Udaipur => Mumbai => Bangalore is 7170 KM. (Generated from initial population size of 10000)
-------------------------------------------------------------------------------------------
Starting 100 iterations of the GA
-------------------------------------------------------------------------------------------
Best solution for initial population size of 10000 and number of runs 100 is
                              Route  Cost
1  [9, 3, 2, 8, 7, 4, 1, 10, 5, 6]  8111
Generated 200(0.006%) of the 3628800 solutions
Total distance travelled to cover the final route of
 Bangalore => Mumbai => Udaipur => Varanasi => Kolkata => Agra => Delhi => Jaipur => Hyderabad => Chennai => Mysore => Bangalore is 8111 KM. (Generated from initial population size of 10000)
-------------------------------------------------------------------------------------------
Starting 1000 iterations of the GA
-------------------------------------------------------------------------------------------
Best solution for initial population size of 10000 and number of runs 1000 is
                              Route  Cost
1  [6, 9, 3, 4, 1, 7, 2, 8, 10, 5]  6917
Generated 2000(0.055%) of the 3628800 solutions
Total distance travelled to cover the final route of
 Bangalore => Mysore => Mumbai => Udaipur => Delhi => Jaipur => Agra => Varanasi => Kolkata => Hyderabad => Chennai => Bangalore is 6917 KM. (Generated from initial population size of 10000)
-------------------------------------------------------------------------------------------